


local function run(msg)
    
    local data = load_data(_config.moderation.data)
    
     if data[tostring(msg.to.id)]['settings']['antifosh'] == 'yes' then
      
    
if not is_momod(msg) then
    
    
chat_del_user('chat#id'..msg.to.id, 'user#id'..msg.from.id, ok_cb, true)
    local msgads = 'ForbiddenAdText'
   local receiver = msg.to.id
    send_large_msg('chat#id'..receiver, msg.."\n", ok_cb, false)
	
      end
   end
end
    
return {patterns = {
        "(ک*س)$",
        "کیر",
	"کص",
	"کــــــــــیر",
	"کــــــــــــــــــــــــــــــیر",
	"کـیـــــــــــــــــــــــــــــــــــــــــــــــــــر",
        "ک×یر",
	"ک÷یر",
	"ک*ص",
	"کــــــــــیرر",
        "عمه جنده",
	"کونی",
	"تخم لولو",
	"کیر تو کون شده",
	"کس نگو",
	"کص نگو",
	"کیرم دهنت",
	"خایم دهنت",
	"جقی",
	"کله کیری",
	"مادر پیاله",
	"گاییدی",
	"گاییدمت",
	"فاک",
	"فاکیو",
	"کسلیس",
	"کصلیص",
	"کصلیس",
	"کسلیص",
	"حرومی",
	"تخم سگ",
	"تخم جن",
	"فاکیو بچ کونی",
	"کیرمم نیستی",
	"به کیرم",
	"به چپم",
	"ب کیرم",
	"ب چپم",
	"کسشر نگو",
	"سکسی",
	"خایمال",
	"بیه",
	"بده بکنیم",
	"نگاییدم",
	"خارتو گاییدم",
	"مادرتو گاییدم",
	"پدر سگ ",
	"ننت زیرمه ",
	"کیری خان",
	"چاقال",
	"کس عمت",
	"کص عمت",
	"به تخمم",
	"سیکتیر",
	"نکنمت",
	"میکنمت",
	"کیر مایی",
	"سگی میکنمت",
	"کیر خر",
	"لاشی",
	"فاک اف",
	"بیلاح",
	"مادرجنده",
	"کسکش",
	"جنده"
  },
  run = run
}
